_posts/devenv/2017-07-27-python-setup.html
---
layout: post
title: "Python 安装配置"
date: 2017-07-27
categories: 研发环境
tags:
    - Python
    - pyenv
excerpt:
keywords: ""
---

<div id="outline-container-orgf06a16e" class="outline-2">
<h2 id="orgf06a16e"><span class="section-number-2">1</span> 安装 pyenv 和 python</h2>
<div class="outline-text-2" id="text-1">
<p>
可以用 brew 来安装 pyenv 的最新版本，而且会自动下载依赖包：
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install pyenv
pyenv -v
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#24110;&#21161;</span>
pyenv help
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28155;&#21152;&#21040; `~/.bash_profile` &#25110; `~/.zprofile` &#25991;&#20214;&#37324;</span>
<span style="color: #4f97d7;">export</span> <span style="color: #7590db;">PYENV_ROOT</span>=$<span style="color: #7590db;">HOME</span>/.pyenv
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28155;&#21152;&#21040; `~/.bashrc` &#25110; `~/.zshrc` &#25991;&#20214;&#37324;</span>
<span style="color: #4f97d7; font-weight: bold;">if </span><span style="color: #4f97d7;">which</span> pyenv &gt;/dev/null; <span style="color: #4f97d7; font-weight: bold;">then </span><span style="color: #4f97d7;">eval</span> <span style="color: #2d9574;">"$(pyenv init -)"</span>; <span style="color: #4f97d7; font-weight: bold;">fi</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">zsh &#36816;&#34892;&#21629;&#20196;&#20351;&#37197;&#32622;&#29983;&#25928;</span>
<span style="color: #4f97d7;">source</span> ~/.zprofile &amp;&amp; <span style="color: #4f97d7;">source</span> ~/.zshrc
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">bash &#36816;&#34892;&#21629;&#20196;&#20351;&#37197;&#32622;&#29983;&#25928;</span>
<span style="color: #4f97d7;">source</span> ~/.bash_profile &amp;&amp; <span style="color: #4f97d7;">source</span> ~/.bashrc
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4dcad6" class="outline-2">
<h2 id="orgf4dcad6"><span class="section-number-2">2</span> 安装 zlib 依赖</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-shell">brew install zlib
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#32534;&#35793;&#31243;&#24207;&#26377;&#38382;&#39064;&#65292;&#23581;&#35797;&#19979;&#21015;&#25805;&#20316;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1. &#22686;&#21152;&#32534;&#35793;&#36873;&#39033;&#35774;&#32622;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For compilers to find this software you may need to set:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">LDFLAGS:  -L/usr/local/opt/zlib/lib</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">CPPFLAGS: -I/usr/local/opt/zlib/include</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For pkg-config to find this software you may need to set:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">PKG_CONFIG_PATH: /usr/local/opt/zlib/lib/pkgconfig</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2. &#23558; zlib &#30340;&#22836;&#25991;&#20214;&#21450;&#24211;&#25991;&#20214;&#28155;&#21152;&#33267;&#31995;&#32479;&#40664;&#35748;&#30340;&#36335;&#24452;</span>
ln -s /usr/local/opt/zlib/include/* /usr/local/include
ln -s /usr/local/opt/zlib/lib/* /usr/local/lib
ln -s /usr/local/opt/zlib/lib/pkgconfig/* /usr/local/lib/pkgconfig
</pre>
</div>
</div>
</div>

<div id="outline-container-org69d45e1" class="outline-2">
<h2 id="org69d45e1"><span class="section-number-2">3</span> pyenv 使用指南</h2>
<div class="outline-text-2" id="text-3">
<p>
pyenv versions 查看系统的上安装的 Python 版本。 `*` 表示当前目录正在使用的版本,其中 的 system 表示系统自带的 Python 版本：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#26412;&#26426;&#29256;&#26412;&#20449;&#24687;</span>
pyenv versions
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26174;&#31034;&#22914;&#19979;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">*system (set by /Users/username/.pyenv/version)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#20854;&#20182;&#29256;&#26412;&#30340; Python&#12290; &#20363;&#22914;&#23433;&#35013; 3.7.0 &#29256;&#26412;&#65306;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26174;&#31034;&#21487;&#20197;&#23433;&#35013;&#30340;&#21015;&#34920;</span>
pyenv install -l
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; python</span>
pyenv install <span style="color: #a45bad;">2.7.15</span>
pyenv install <span style="color: #a45bad;">3.7.0</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#26032;&#26412;&#22320;&#25968;&#25454;&#24211;</span>
pyenv rehash
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#26412;&#26426;&#29256;&#26412;&#20449;&#24687;</span>
pyenv versions
</pre>
</div>

<p>
国内网络环境如果下载不下来的话，可以把显示的下载地址的文件用自己电脑的迅雷下载下来，
然后传到 `~/.pyenv/cache` 里（cache 文件夹没有的话手动创建一个），
然后执行 `pyenv install x.x.x` 就可以了。 也可以使用阿里云来加速下载：`vim ~/.pip/pip.conf`
</p>

<p>
<code>内容如下</code>
</p>
<div class="org-src-container">
<pre class="src src-ini">[global]
index-url=http://mirrors.aliyun.com/pypi/simple/
[install]
trusted-host=mirrors.aliyun.com
</pre>
</div>
</div>
</div>

<div id="outline-container-org16bc1cb" class="outline-2">
<h2 id="org16bc1cb"><span class="section-number-2">4</span> pyenv 的其他操作</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21368;&#36733;&#25351;&#23450;&#30340;&#21253;&#65306;</span>
pyenv uninstall <span style="color: #a45bad;">3.7.0</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#25913;&#26412;&#26426;&#29256;&#26412;&#65292;&#37325;&#21551;&#19981;&#20250;&#36896;&#25104;&#20877;&#27425;&#26356;&#25913;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35774;&#32622; Global Python &#20026; 2.*, &#22791;&#27880;&#65306;&#23613;&#37327;&#19981;&#35201;&#25226; Python 3 &#35774;&#32622;&#20026;&#20840;&#23616;&#65292;&#21542;&#21017;&#30001;&#20110; Homebrew &#26412;&#36523;&#26377;&#19968;&#20123;&#24212;&#29992;&#26159;&#20381;&#36182;&#20110; Python2 &#30340;&#65292;&#35774;&#32622;&#20026; Python2 &#23481;&#26131;&#20986;&#29616;&#19968;&#20123;&#22855;&#24618;&#30340;&#38382;&#39064;&#12290;</span>
pyenv global <span style="color: #a45bad;">2.7.15</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#24120;&#29992;&#21253;</span>
pip install -i https://pypi.doubanio.com/simple requests
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#36825;&#20010;&#26159;&#29992;&#20110;&#23433;&#35013;&#22522;&#26412;&#30340;&#20195;&#30721;&#34917;&#20840;&#21151;&#33021;</span>
pip install -i https://pypi.doubanio.com/simple --upgrade <span style="color: #2d9574;">"jedi&gt;=0.9.0"</span> <span style="color: #2d9574;">"json-rpc&gt;=1.8.1"</span> <span style="color: #2d9574;">"service_factory&gt;=0.1.5"</span> flake8 pytest autoflake hy

python version
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">==&gt; Python 2.7.15</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20165;&#23545;&#24403;&#21069;&#30446;&#24405;&#21450;&#23376;&#30446;&#24405;&#29983;&#25928;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">pyenv local system</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">python version</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">==&gt; Python 2.7.10</span>
<span style="color: #2aa1ae; background-color: #292e34;">#  </span><span style="color: #2aa1ae; background-color: #292e34;">&#26356;&#25913;&#26412; shell &#30340;&#29256;&#26412;&#65292;&#20020;&#26102;&#29983;&#25928;&#65292;&#20248;&#20808;&#32423;&#39640;&#20110; global&#65292;local &#30340;&#20063;&#39640;&#20110; global&#65292;&#37117;&#26159;&#20020;&#26102;&#29983;&#25928;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">python shell 3.7.0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b9f1cc" class="outline-2">
<h2 id="org0b9f1cc"><span class="section-number-2">5</span> pyenv 命令</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">pyenv version</td>
<td class="org-left">查看当前系统使用的 python 版本</td>
</tr>

<tr>
<td class="org-left">pyenv versions</td>
<td class="org-left">查看当前系统拥有的 python 版本</td>
</tr>

<tr>
<td class="org-left">pyenv install 3.4.1</td>
<td class="org-left">安装 3.4.1，可使用 -v 参数查看详细输出</td>
</tr>

<tr>
<td class="org-left">pyenv uninstall 3.4.1</td>
<td class="org-left">卸载 3.4.1</td>
</tr>

<tr>
<td class="org-left">pyenv local 3.4.1</td>
<td class="org-left">local 仅对当前目录及子目录生效，告诉当前目录使用版本 2.7.5，</td>
</tr>

<tr>
<td class="org-left">pyenv global</td>
<td class="org-left">全局使用某个版本，不建议使用 global 设置全局版本</td>
</tr>

<tr>
<td class="org-left">pyenv rehash</td>
<td class="org-left">重建环境，每次增删版本或带可执行文件的包（如 pip）后，都应执行</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org246ff2c" class="outline-2">
<h2 id="org246ff2c"><span class="section-number-2">6</span> pyenv-virtualenv 安装</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org1e300f7" class="outline-3">
<h3 id="org1e300f7"><span class="section-number-3">6.1</span> 安装 pyenv-virtualenv</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-shell">brew install pyenv-virtualenv
</pre>
</div>

<p>
修改 `~/bashrc` 或 `~/.zshrc`, 添加以下内容
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7; font-weight: bold;">if </span><span style="color: #4f97d7;">which</span> pyenv-virtualenv-init &gt;/dev/null; <span style="color: #4f97d7; font-weight: bold;">then </span><span style="color: #4f97d7;">eval</span> <span style="color: #2d9574;">"$(pyenv virtualenv-init -)"</span>; <span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org56298b1" class="outline-3">
<h3 id="org56298b1"><span class="section-number-3">6.2</span> 使用 pyenv-virtualenv</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#34394;&#25311;&#29615;&#22659;</span>
pyenv virtualenv <span style="color: #a45bad;">2.7.15</span> env27
pyenv virtualenv <span style="color: #a45bad;">3.7.0</span> env37
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26174;&#31034;&#34394;&#25311;&#29615;&#22659;</span>
pyenv virtualenvs
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;&#34394;&#25311;&#29615;&#22659;&#21450;&#36864;&#20986;&#34394;&#25311;&#29615;&#22659;&#65292;&#21487;&#33021;&#38656;&#35201;&#37325;&#21551; shell</span>
pyenv activate env37

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#24120;&#29992;&#21253;</span>
pip install -i https://pypi.doubanio.com/simple requests
pip install -i https://pypi.doubanio.com/simple beatutifulsoup4
pip install -i https://pypi.doubanio.com/simple ipython<span style="color: #4f97d7;">[</span>notebook<span style="color: #4f97d7;">]</span>
pip install -i https://pypi.doubanio.com/simple jupyter
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#36825;&#20010;&#26159;&#29992;&#20110;&#23433;&#35013;&#22522;&#26412;&#30340;&#20195;&#30721;&#34917;&#20840;&#21151;&#33021;</span>
pip install -i https://pypi.doubanio.com/simple --upgrade <span style="color: #2d9574;">"jedi&gt;=0.9.0"</span> <span style="color: #2d9574;">"json-rpc&gt;=1.8.1"</span> <span style="color: #2d9574;">"service_factory&gt;=.1.5"</span> flake8 pytest autoflake hy
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#32467;&#26463;&#23433;&#35013;&#21253;&#65292;&#35299;&#38500; env37</span>
pyenv deactivate

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25253;&#38169;&#65306;Failed to activate virtualenv.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21487;&#20197;&#23581;&#35797;&#20351;&#29992;&#19979;&#21015;&#21629;&#20196;</span>
<span style="color: #4f97d7;">source</span> activate env37
<span style="color: #4f97d7;">source</span> deactivate
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21024;&#38500;&#24050;&#23384;&#22312;&#30340;</span>
pyenv uninstall env37
</pre>
</div>
</div>
</div>
</div>
